#include <stdio.h>

int main(int argc, char const *argv[])
{
    int i = 5;
    int j = 7;
    int k;
    k = i & j;  // & 二进制每一位相与  
    /*
            0  1  0  1
            0  1  1  1
            __________
            0  1  0  1    ====> 5 (十进制)
        
        1&1 = 1
        1&0 = 0
        0&1 = 0
        0&0 = 0

        负数二进制
        每位取反再加一 符号位为1
    */
    printf("%d", k);
    return 0;
}
/*
    | 按位或 

    ~ 按位取反 //  0000 0011  --> 1111 1100

    ^ 按位异或
      相同为零
      不同为1
      1^0 = 1
      0^1 = 1
      1^1 = 1
      0^0 = 0
    << 按位左移
        i<<1 表示把i的所以二进制位左移一位,右边补零
        左移n位相当于乘以2的n次方
        (移位运算符执行效率更快) 例如: i = i * 8; i = i << 3;


    >> 按位右移
        i>>1 表示把i的所以二进制位右移一位,左边一般补零,也可能补1
        右移n位相当于除以2的n次方,前提数据不能丢失
      
      位运算的现实意义
        通过位运算符我们可以对数据精确到每一位

*/