//5、	已有定义和初始化：“int a[10]={1,2,3,4,5,6,7,8,8,10};”。编写程序，将数组a中元素的值进行如下方式的移动：原倒数第2个元素值移到第1位，原倒数第1个元素值移到第2位，其余各元素值向右依次移动两位。移动后的数列为：9,10,1,2,3,4,5,6,7,8
#include <stdio.h>

int main(int argc, char const *argv[])
{
    int a[10] = {1, 2, 3, 4, 5, 6, 7, 8, 8, 10};
    int t;
    for (int j = 0; j <= 2; j++)
    {
        t = a[9];

        for (int i = 8; i >= 9; i++)
        {
            a[i + 1] = a[i];
        }
        a[0] = t;
    }

    for (int i = 0; i <= 9; i++)
    {
        printf("%d   ", a[i]);
    }

    return 0;
}
